"use strict"

import { Товар } from "./Products.js";
import { CatalogArray } from "./CatalogArray.js";

let catalog = new CatalogArray(
  new Товар('Перфоратор Makita', 12990, 56, 'Мощность: 800 Вт'),
  new Товар('Перфоратор ИНТЕРСКОЛ', 5199, 76, 'Мощность: 780 Вт'),
  new Товар('Перфоратор Metabo', 11990, 17, 'Мощность: 800 Вт'),
  new Товар('Перфоратор Bosch', 9649, 31, 'Мощность: 790 Вт'),
  new Товар('Дрель-шуруповерт Makita', 9549, 42, 'Напряжение аккумулятора: 10,8 В'),
  new Товар('Дрель-шуруповерт ИНТЕРСКОЛ', 6799, 21, 'Напряжение аккумулятора: 14 В'),
  new Товар('Дрель-шуруповерт Metabo', 14490, 36, 'Напряжение аккумулятора: 18 В'),
  new Товар('Дрель-шуруповерт Bosch', 12499, 5, 'Напряжение аккумулятора: 14 В'),
  new Товар('Рубанок электрический Makita', 18990, 7, 'Мощность: 750 Вт'),
  new Товар('Рубанок электрический BLACK+DECKER', 4799, 7, 'Мощность: 650 Вт'),
  new Товар('Рубанок электрический Bosch', 11090, 19, 'Мощность: 650 Вт'),
  new Товар('Рубанок электрический ИНТЕРСКОЛ', 5499, 22, 'Мощность: 710 Вт'),
  new Товар('Лобзик электрический Metabo', 10890, 46, 'Максимальная частота хода: 3300 об/мин'),
  new Товар('Лобзик электрический Bosch', 9049, 15, 'Максимальная частота хода: 3100 об/мин'),
  new Товар('Лобзик электрический ИНТЕРСКОЛ', 5499, 33, 'Максимальная частота хода: 3000 об/мин'),
  new Товар('Лобзик электрический Hitachi ', 6188, 2, 'Максимальная частота хода: 2900 об/мин'),
);

console.log( catalog.select('name-starts-рубанок&price-<15000&description-contains-650') ); // 2 совпадения

console.log( catalog.select('name-contains-элект&price->=6188') ); // 5 совпадений

console.log( catalog.select('description-ends-об/мин&quantity-<33') ); // 2 совпадения

console.log( catalog.select('description-contains-:&name-ends-ол') ); // 4 совпадения

console.log( catalog.select('quantity-=2&price->6000&name-contains-ita&description-starts-мак') ); // 1 совпадение

console.log( catalog.select('price-<3000') ); // 0 совпадений